Aidan-Bennett/Wireless-Multi-Sensor-Data-acquisition-system_Code/Arduino Board Files/Board Variant Files/ATMega32u4/boards.txt
##############################################################
# BRANZ Sensor unit 32u4 Configuration
SensNode.name=BRANZ SensNode  
SensNode.bootloader.low_fuses=0xff
SensNode.bootloader.high_fuses=0x5c
SensNode.bootloader.extended_fuses=0xcb
SensNode.bootloader.file=caterina/Caterina-Feather32u4.hex
SensNode.bootloader.unlock_bits=0x3F
SensNode.bootloader.lock_bits=0x2F
SensNode.bootloader.tool=arduino:avrdude
SensNode.build.mcu=atmega32u4
SensNode.build.f_cpu=8000000L
SensNode.build.vid=0x239A
SensNode.build.pid=0x00F0
SensNode.build.core=arduino:arduino
SensNode.build.variant=feather32u4
SensNode.build.board=AVR_FEATHER32U4
SensNode.build.usb_product="BRANZ SensNode  "
SensNode.build.usb_manufacturer="Adafruit"
SensNode.build.extra_flags={build.usb_flags}
SensNode.upload.protocol=avr109
SensNode.upload.maximum_size=28672
SensNode.upload.speed=57600
SensNode.upload.disable_flushing=true
SensNode.upload.use_1200bps_touch=true
SensNode.upload.wait_for_upload_port=true
SensNode.upload.tool=arduino:avrdude
SensNode.vid.0=0x239A
SensNode.pid.0=0x00F0